docs/load testing results.txt
user@ver-blr-lt1070:~$ ab -n 10000 -c 100 http://192.168.1.2:8080/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.2 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        192.168.1.2
Server Port:            8080

Document Path:          /
Document Length:        1060 bytes

Concurrency Level:      100
Time taken for tests:   45.061 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      11240000 bytes
HTML transferred:       10600000 bytes
Requests per second:    221.92 [#/sec] (mean)
Time per request:       450.614 [ms] (mean)
Time per request:       4.506 [ms] (mean, across all concurrent requests)
Transfer rate:          243.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21  234 252.6    217    3106
Processing:    18  214  79.0    215    1247
Waiting:       18  213  78.9    214    1247
Total:         54  448 269.5    433    3494

Percentage of the requests served within a certain time (ms)
  50%    433
  66%    457
  75%    468
  80%    478
  90%    513
  95%    541
  98%    616
  99%   1349
 100%   3494 (longest request)